### 1. Data Preparation

In [1]:
# importing modules
import pandas as pd
import numpy as np
import locale
from datetime import datetime as dt
import matplotlib.pyplot as plt
%matplotlib inline

#Displaying all dataframe columns
pd.set_option('display.max_columns', None)

In [2]:
#Loading datasets
base = pd.read_fwf('prueba_txt.txt', header=None)

In [3]:
base.head()

           0       1    2                         3     4
0      ADRIA  Diesel  NaN                   Galicia  0001
1  ALFAROMEO  Diesel  NaN                 Andalucía  0047
2  ALFAROMEO  Diesel  NaN                    Aragón  0041
3  ALFAROMEO  Diesel  NaN  Asturias (Principado de)  0010
4  ALFAROMEO  Diesel  NaN           Balears (Illes)  0006

In [4]:
#eliminamos la columna sin valores
base = base.drop(2, axis=1)
base.dtypes

0    object
1    object
3    object
4    object
dtype: object

In [5]:
#insertamos la columna de consecutivo
base.insert(4, 'Consecutivo', range(1, 1 + len(base)))
base.head()

           0       1                         3     4  Consecutivo
0      ADRIA  Diesel                   Galicia  0001            1
1  ALFAROMEO  Diesel                 Andalucía  0047            2
2  ALFAROMEO  Diesel                    Aragón  0041            3
3  ALFAROMEO  Diesel  Asturias (Principado de)  0010            4
4  ALFAROMEO  Diesel           Balears (Illes)  0006            5

In [6]:
#insertamos la columna con la fecha requerida
base['Fecha']= pd.to_datetime("'06-07-2019'", dayfirst=True)
base.head()

           0       1                         3     4  Consecutivo      Fecha
0      ADRIA  Diesel                   Galicia  0001            1 2019-07-06
1  ALFAROMEO  Diesel                 Andalucía  0047            2 2019-07-06
2  ALFAROMEO  Diesel                    Aragón  0041            3 2019-07-06
3  ALFAROMEO  Diesel  Asturias (Principado de)  0010            4 2019-07-06
4  ALFAROMEO  Diesel           Balears (Illes)  0006            5 2019-07-06

In [7]:
#cambiamos los nombres de las columnas 
base.columns = ['Marca', 'Tipo', 'Ubicacion', 'Placa', 'Consecutivo', 'Fecha']
base.head()

       Marca    Tipo                 Ubicacion Placa  Consecutivo      Fecha
0      ADRIA  Diesel                   Galicia  0001            1 2019-07-06
1  ALFAROMEO  Diesel                 Andalucía  0047            2 2019-07-06
2  ALFAROMEO  Diesel                    Aragón  0041            3 2019-07-06
3  ALFAROMEO  Diesel  Asturias (Principado de)  0010            4 2019-07-06
4  ALFAROMEO  Diesel           Balears (Illes)  0006            5 2019-07-06

In [8]:
base.dtypes

Marca                  object
Tipo                   object
Ubicacion              object
Placa                  object
Consecutivo             int32
Fecha          datetime64[ns]
dtype: object

In [9]:
#una vez realizados los cambios a la base de datos la exportamos a .csv
base.to_csv('2do_punto_prueba.csv', index=False, header=True, encoding="utf-8")